Narin-Laboratory/libudawa-esp32/src/libudawa.h
BaseType_t xReturnedWifiKeeper;
BaseType_t xReturnedAlarm;
BaseType_t xReturnedWifiOta;
BaseType_t xReturnedTB;
BaseType_t xReturnedIface;

TaskHandle_t xHandleWifiKeeper = NULL;
TaskHandle_t xHandleAlarm = NULL;
TaskHandle_t xHandleWifiOta;
TaskHandle_t xHandleTB;
#ifdef USE_WEB_IFACE
TaskHandle_t xHandleIface;
#endif

SemaphoreHandle_t xSemaphoreSerialCoMCU = NULL;
SemaphoreHandle_t xSemaphoreUDPLogger = NULL;
SemaphoreHandle_t xSemaphoreSettings = NULL;
SemaphoreHandle_t xSemaphoreConfig = NULL;
SemaphoreHandle_t xSemaphoreConfigCoMCU = NULL;
SemaphoreHandle_t xSemaphoreTBSend = NULL;

struct AlarmMessage
{
    uint16_t code;
    uint8_t color; 
    int32_t blinkCount; 
    uint16_t blinkDelay;
};
QueueHandle_t xQueueAlarm;


void startup() {
  xQueueAlarm = xQueueCreate( 1, sizeof( struct AlarmMessage ) );

  if(xSemaphoreSerialCoMCU == NULL){xSemaphoreSerialCoMCU = xSemaphoreCreateMutex();}
  if(xSemaphoreUDPLogger == NULL){xSemaphoreUDPLogger = xSemaphoreCreateMutex();}
  if(xSemaphoreSettings == NULL){xSemaphoreSettings = xSemaphoreCreateMutex();}
  if(xSemaphoreConfig == NULL){xSemaphoreConfig = xSemaphoreCreateMutex();}
  if(xSemaphoreConfigCoMCU == NULL){xSemaphoreConfigCoMCU = xSemaphoreCreateMutex();}
  if(xSemaphoreTBSend == NULL){xSemaphoreTBSend = xSemaphoreCreateMutex();}

  // put your setup code here, to run once:
  Serial.begin(115200);

  config.logLev = 5;
  log_manager->add_logger(&serial_logger);
  log_manager->add_logger(&udp_logger);
  log_manager->set_log_level(PSTR("*"), (LogLevel) config.logLev);
  if(!SPIFFS.begin(true))
  {
    //configReset();
    configLoadFailSafe();
    log_manager->error(PSTR(__func__), PSTR("Problem with SPIFFS file system. Failsafe config was loaded.\n"));
  }
  else
  {
    log_manager->info(PSTR(__func__), PSTR("Loading config...\n"));
    configLoad();
    log_manager->set_log_level(PSTR("*"), (LogLevel) config.logLev);
  }

  
  #ifdef USE_SERIAL2
    log_manager->debug(PSTR(__func__), PSTR("Serial 2 - CoMCU Activated!\n"));
    Serial2.begin(115200, SERIAL_8N1, S2_RX, S2_TX);
  #endif

  log_manager->debug(PSTR(__func__), PSTR("Startup time: %s\n"), rtc.getDateTime().c_str());

  int tBytes = SPIFFS.totalBytes(); 
  int uBytes = SPIFFS.usedBytes();
  log_manager->verbose(PSTR(__func__), PSTR("SPIFFS total bytes: %d, used bytes: %d, free space: %d.\n"), tBytes, uBytes, tBytes-uBytes);

  xReturnedWifiKeeper = xTaskCreatePinnedToCore(wifiKeeperTR, "wifiKeeper", 4096, NULL, 1, &xHandleWifiKeeper, 1);
  xReturnedAlarm = xTaskCreatePinnedToCore(setAlarmTR, "setAlarm", 4096, NULL, 1, &xHandleAlarm, 1);

}


/// @brief Update callback that will be called as soon as the requested shared attributes, have been received.
/// The callback will then not be called anymore unless it is reused for another request
/// @param data Data containing the shared attributes that were requested and their current value
void processSharedAttributeRequest(const Shared_Attribute_Data &data) {
  int jsonSize = JSON_STRING_SIZE(measureJson(data));
  char buffer[jsonSize];
  serializeJson(data, buffer, jsonSize);
  log_manager->verbose(PSTR(__func__), PSTR("Received shared attribute(s): %s.\n"), buffer);
}

/// @brief Update callback that will be called as soon as the requested client-side attributes, have been received.
/// The callback will then not be called anymore unless it is reused for another request
/// @param data Data containing the client-side attributes that were requested and their current value
void processClientAttributeRequest(const Shared_Attribute_Data &data) {
  int jsonSize = JSON_STRING_SIZE(measureJson(data));
  char buffer[jsonSize];
  serializeJson(data, buffer, jsonSize);
  log_manager->verbose(PSTR(__func__), PSTR("Received client attribute(s): %s.\n"), buffer);
}

void processSharedAttributeUpdate(const Shared_Attribute_Data &data){
  if( xSemaphoreConfig != NULL ){
    if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
    {
      if(data["model"] != nullptr){strlcpy(config.model, data["model"].as<const char*>(), sizeof(config.model));}
      if(data["group"] != nullptr){strlcpy(config.group, data["group"].as<const char*>(), sizeof(config.group));}
      if(data["broker"] != nullptr){strlcpy(config.broker, data["broker"].as<const char*>(), sizeof(config.broker));}
      if(data["port"] != nullptr){config.port = data["port"].as<uint16_t>();}
      if(data["wssid"] != nullptr){strlcpy(config.wssid, data["wssid"].as<const char*>(), sizeof(config.wssid));}
      if(data["wpass"] != nullptr){strlcpy(config.wpass, data["wpass"].as<const char*>(), sizeof(config.wpass));}
      if(data["dssid"] != nullptr){strlcpy(config.dssid, data["dssid"].as<const char*>(), sizeof(config.dssid));}
      if(data["dpass"] != nullptr){strlcpy(config.dpass, data["dpass"].as<const char*>(), sizeof(config.dpass));}
      if(data["upass"] != nullptr){strlcpy(config.upass, data["upass"].as<const char*>(), sizeof(config.upass));}
      if(data["accTkn"] != nullptr){strlcpy(config.accTkn, data["accTkn"].as<const char*>(), sizeof(config.accTkn));}
      if(data["provDK"] != nullptr){strlcpy(config.provDK, data["provDK"].as<const char*>(), sizeof(config.provDK));}
      if(data["provDS"] != nullptr){strlcpy(config.provDS, data["provDS"].as<const char*>(), sizeof(config.provDS));}
      if(data["logLev"] != nullptr){config.logLev = data["logLev"].as<uint8_t>(); log_manager->set_log_level(PSTR("*"), (LogLevel) config.logLev);;}
      if(data["gmtOff"] != nullptr){config.gmtOff = data["gmtOff"].as<int>();}
      if(data["fIoT"] != nullptr){config.fIoT = data["fIoT"].as<int>();}
      if(data["htU"] != nullptr){strlcpy(config.htU, data["htU"].as<const char*>(), sizeof(config.htU));}
      if(data["htP"] != nullptr){strlcpy(config.htP, data["htP"].as<const char*>(), sizeof(config.htP));}
      if(data["fWOTA"] != nullptr){config.fWOTA = data["fWOTA"].as<bool>();}
      if(data["fIface"] != nullptr){config.fIface = data["fIface"].as<bool>();}
      if(data["hname"] != nullptr){strlcpy(config.hname, data["hname"].as<const char*>(), sizeof(config.hname));}
      if(data["logIP"] != nullptr){strlcpy(config.logIP, data["logIP"].as<const char*>(), sizeof(config.logIP));}
      if(data["logPrt"] != nullptr){config.logPrt = data["logPrt"].as<uint16_t>();}
      xSemaphoreGive( xSemaphoreConfig );
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }

  if( xSemaphoreConfigCoMCU != NULL ){
    if( xSemaphoreTake( xSemaphoreConfigCoMCU, ( TickType_t ) 1000 ) == pdTRUE )
    {
      if(data["fP"] != nullptr){configcomcu.fP = data["fP"].as<bool>();}
      if(data["bFr"] != nullptr){configcomcu.bFr = data["bFr"].as<uint16_t>();}
      if(data["fB"] != nullptr){configcomcu.fB = data["fB"].as<bool>();}
      if(data["pBz"] != nullptr){configcomcu.pBz = data["pBz"].as<uint8_t>();}
      if(data["pLR"] != nullptr){configcomcu.pLR = data["pLR"].as<uint8_t>();}
      if(data["pLG"] != nullptr){configcomcu.pLG = data["pLG"].as<uint8_t>();}
      if(data["pLB"] != nullptr){configcomcu.pLB = data["pLB"].as<uint8_t>();}
      if(data["lON"] != nullptr){configcomcu.lON = data["lON"].as<uint8_t>();}
      xSemaphoreGive( xSemaphoreConfigCoMCU );
    }
    else
    {
      log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }


  int jsonSize = JSON_STRING_SIZE(measureJson(data));
  char buffer[jsonSize];
  serializeJson(data, buffer, jsonSize);
  log_manager->verbose(PSTR(__func__), PSTR("Received shared attribute(s) update: %s.\n"), buffer);

  processSharedAttributeUpdateCb(data);
}

void tbOtaFinishedCb(const bool& success){
  if(success){
    log_manager->info(PSTR(__func__), PSTR("IoT OTA update success!\n"));
  }else{
    log_manager->warn(PSTR(__func__), PSTR("IoT OTA update failed!\n"));
  }
}

void tbOtaProgressCb(const uint32_t& currentChunk, const uint32_t& totalChuncks){
  log_manager->verbose(PSTR(__func__), PSTR("IoT OTA Progress %.2f%%\n"), static_cast<float>(currentChunk * 100U) / totalChuncks);
}

