Narin-Laboratory/libudawa-esp32/src/libudawa.h
#ifdef USE_WEB_IFACE
void ifaceTR(void *arg){
  web.on(PSTR("/"), []() { webSendFile("/www/index.html", "text/html"); });
  web.on(PSTR("/runtime.js"), []() { webSendFile("/www/runtime.js", "application/javascript"); });
  web.on(PSTR("/polyfills.js"), []() { webSendFile("/www/polyfills.js", "application/javascript"); });
  web.on(PSTR("/main.js"), []() { webSendFile("/www/main.js", "application/javascript"); });
  web.on(PSTR("/styles.css"), []() { webSendFile("/www/styles.css", "text/css"); });
  web.on(PSTR("/assets/img/udawa.svg"), []() { webSendFile("/www/assets/img/udawa.svg", "image/svg+xml"); });
  web.on(PSTR("/favicon"), []() { webSendFile("/www/favicon.ico", "image/x-icon"); });

  web.begin();

  ws.begin();
  ws.onEvent(onWsEventCb);

  while(true){
    ws.loop();
    web.handleClient();
    vTaskDelay((const TickType_t) 10 / portTICK_PERIOD_MS);
  }
}
#endif


void wifiOtaTR(void *arg){
  ArduinoOTA.setHostname(config.hname);
  ArduinoOTA.setPasswordHash(config.upass);
  ArduinoOTA.begin();

  ArduinoOTA
    .onStart([]()
    {
      String type;
      if (ArduinoOTA.getCommand() == U_FLASH)
          type = "sketch";
      else // U_SPIFFS
          type = "filesystem";
          SPIFFS.end();
      log_manager->warn(PSTR(__func__),PSTR("Starting OTA %s\n"), type.c_str());
    })
    .onEnd([]()
    {
      log_manager->warn(PSTR(__func__),PSTR("Device rebooting...\n"));
      reboot();
    })
    .onProgress([](unsigned int progress, unsigned int total)
    {
      log_manager->warn(PSTR(__func__),PSTR("OTA progress: %d/%d\n"), progress, total);
    })
    .onError([](ota_error_t error)
    {
      log_manager->warn(PSTR(__func__),PSTR("OTA Failed: %d\n"), error);
      reboot();
    }
  );

  while(true){
    ArduinoOTA.handle();
    vTaskDelay((const TickType_t) 10 / portTICK_PERIOD_MS);
  }
}

void processProvisionResponse(const Provision_Data &data)
{
  constexpr char CREDENTIALS_TYPE[] PROGMEM = "credentialsType";
  constexpr char CREDENTIALS_VALUE[] PROGMEM = "credentialsValue";
  int jsonSize = JSON_STRING_SIZE(measureJson(data));
  char buffer[jsonSize];
  serializeJson(data, buffer, jsonSize);
  log_manager->verbose(PSTR(__func__),PSTR("Received device provision response: %s\n"), buffer);

  if (strncmp(data["status"], "SUCCESS", strlen("SUCCESS")) != 0) {
    log_manager->warn(PSTR(__func__),PSTR("Provision response contains the error: (%s)\n"), data["errorMsg"].as<const char*>());
    return;
  }

  if (strncmp(data[CREDENTIALS_TYPE], ACCESS_TOKEN_CRED_TYPE, strlen(ACCESS_TOKEN_CRED_TYPE)) == 0) {
    strlcpy(config.accTkn, data[CREDENTIALS_VALUE].as<std::string>().c_str(), sizeof(config.accTkn));
    config.provSent = true;  
    configSave();

  }
  else if (strncmp(data[CREDENTIALS_TYPE], MQTT_BASIC_CRED_TYPE, strlen(MQTT_BASIC_CRED_TYPE)) == 0) {
    /*auto credentials_value = data[CREDENTIALS_VALUE].as<JsonObjectConst>();
    credentials.client_id = credentials_value[CLIENT_ID].as<std::string>();
    credentials.username = credentials_value[CLIENT_USERNAME].as<std::string>();
    credentials.password = credentials_value[CLIENT_PASSWORD].as<std::string>();*/
  }
  else {
    log_manager->warn(PSTR(__func__),PSTR("Unexpected provision credentialsType: (%s)\n"), data[CREDENTIALS_TYPE].as<const char*>());
    return;
  }

  // Disconnect from the cloud client connected to the provision account, because it is no longer needed the device has been provisioned
  // and we can reconnect to the cloud with the newly generated credentials.
  if (tb.connected()) {
    tb.disconnect();
  }
}


void TBTR(void *arg){
  uint8_t tbDisco = 0;
  while(true){
    if(!config.provSent)
    {
      if (tb.connect(config.broker, "provision", config.port)) {
        const Provision_Callback provisionCallback(Access_Token(), &processProvisionResponse, config.provDK, config.provDS, config.name);
        if(tb.Provision_Request(provisionCallback))
        {
          log_manager->info(PSTR(__func__),PSTR("Connected to provisioning server: %s:%d\n"),  config.broker, config.port);
        }
      }
      else
      {
        log_manager->warn(PSTR(__func__),PSTR("Failed to connect to provisioning server: %s:%d\n"),  config.broker, config.port);
      }
      while(true){
        tb.loop();
        if(config.provSent){break;}
        vTaskDelay((const TickType_t)10 / portTICK_PERIOD_MS);
      }
    }
    else{
      if(!tb.connected())
      {
        log_manager->warn(PSTR(__func__),PSTR("IoT disconnected!\n"));
        onTbDisconnectedCb();
        log_manager->info(PSTR(__func__),PSTR("Connecting to broker %s:%d\n"), config.broker, config.port);
        while(!tb.connect(config.broker, config.accTkn, config.port, config.name)){  
          tbDisco++;
          log_manager->warn(PSTR(__func__),PSTR("Failed to connect to IoT Broker %s (%d)\n"), config.broker, tbDisco);
          if(tbDisco >= 10){
            if( xSemaphoreConfig != NULL ){
              if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
              {
                config.provSent = 0;
                xSemaphoreGive( xSemaphoreConfig );
              }
              else
              {
                log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
              }
            }
            tbDisco = 0;
            break;
          }
          vTaskDelay((const TickType_t)1000 / portTICK_PERIOD_MS);
        }

        //bool tbShared_status = tb.Shared_Attributes_Request(tbSharedCb);
        //bool tbClient_status = tb.Client_Attributes_Request(tbClientCb);
        bool tbSharedUpdate_status = tb.Shared_Attributes_Subscribe(tbSharedAttrUpdateCb);
        bool tbClientRPC_status = tb.RPC_Subscribe(clientRPCCallbacks.cbegin(), clientRPCCallbacks.cend());
        

        if( xSemaphoreConfig != NULL ){
          if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
          {
            if (!config.currentFWSent) {
              constexpr char FW_STATE_UPDATED[] PROGMEM = "UPDATED";
              config.currentFWSent = tb.Firmware_Send_Info(CURRENT_FIRMWARE_TITLE, CURRENT_FIRMWARE_VERSION) && tb.Firmware_Send_State(FW_STATE_UPDATED);
            }
            if (!config.updateRequestSent) {
              config.updateRequestSent = tb.Subscribe_Firmware_Update(tbOtaCb);
            }
            xSemaphoreGive( xSemaphoreConfig );
          }
          else
          {
            log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
          }
        }

        onTbConnectedCb();
        log_manager->info(PSTR(__func__),PSTR("IoT Connected!\n"));
      }
    }

    tb.loop();
    vTaskDelay((const TickType_t) 10 / portTICK_PERIOD_MS);
  }
}


