Narin-Laboratory/libudawa-esp32/src/libudawa.h
void emitAlarm(int code){
  if(tb.connected()){
    StaticJsonDocument<DOCSIZE_MIN> doc;
    doc[PSTR("alarm")] = code;
    tbSendTelemetry(doc);
  }
  emitAlarmCb(code);
  log_manager->error(PSTR(__func__), PSTR("%i\n"), code);
}

void rtcUpdate(long ts){
  long startMillis = millis();
  if(ts == 0){
    configTime(config.gmtOff, 0, "pool.ntp.org");
    struct tm timeinfo;
    if (getLocalTime(&timeinfo)){
      rtc.setTimeStruct(timeinfo);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via NTP: %s GMT Offset:%d (%d) \n"), rtc.getDateTime().c_str(), config.gmtOff, config.gmtOff / 3600);
    }
  }else{
      rtc.setTime(ts);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via timestamp: %s\n"), rtc.getDateTime().c_str());
  }
  log_manager->verbose(PSTR(__func__), PSTR("Executed (%dms).\n"), millis() - startMillis);
}

void cbWiFiOnDisconnected(WiFiEvent_t event, WiFiEventInfo_t info)
{
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s and %s) Disconnected!\n"), config.wssid, config.dssid);
  if(config.fIoT && xHandleTB != NULL){
    vTaskDelete(xHandleTB);
    log_manager->warn(PSTR(__func__), PSTR("Task TB has been deleted.\n"));
  }

  if(config.fWOTA && xHandleWifiOta != NULL){
    vTaskDelete(xHandleWifiOta);
    log_manager->warn(PSTR(__func__), PSTR("Task WifiOta has been deleted.\n"));
  }

  #ifdef USE_WEB_IFACE
  if(config.fIface && xHandleIface != NULL){
    vTaskDelete(xHandleIface);
    log_manager->warn(PSTR(__func__), PSTR("Task iface has been deleted.\n"));
  }
  #endif
}

void cbWiFiOnGotIp(WiFiEvent_t event, WiFiEventInfo_t info)
{
  long startMillis = millis();
  IPAddress ip = WiFi.localIP();
  char ipa[25];
  sprintf(ipa, "%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s) IP Assigned: %s!\n"), WiFi.SSID().c_str(), ipa);

  ssl.setCACert(CA_CERT);

  MDNS.begin(config.hname);
  MDNS.addService("http", "tcp", 80);
  log_manager->info(PSTR(__func__),PSTR("Started MDNS on %s\n"), config.hname);

  rtcUpdate(0);
  if(config.fWOTA && xHandleWifiOta == NULL){
    xReturnedWifiOta = xTaskCreatePinnedToCore(wifiOtaTR, "wifiOta", 6144, NULL, 1, &xHandleWifiOta, 1);
    if(xReturnedWifiOta == pdPASS){
      log_manager->warn(PSTR(__func__), PSTR("Task wifiOta has been created.\n"));
    }
  }

  if(config.fIoT && xHandleTB == NULL){
    xReturnedTB = xTaskCreatePinnedToCore(TBTR, "TB", 16384, NULL, 1, &xHandleTB, 1);
    if(xReturnedTB == pdPASS){
      log_manager->warn(PSTR(__func__), PSTR("Task TB has been created.\n"));
    }
  }

  #ifdef USE_WEB_IFACE
  if(config.fIface && xHandleIface == NULL){
    xReturnedIface = xTaskCreatePinnedToCore(ifaceTR, "iface", 10240, NULL, 1, &xHandleIface, 1);
    if(xReturnedIface == pdPASS){
      log_manager->warn(PSTR(__func__), PSTR("Task iface has been created.\n"));
    }
  }
  #endif

  if(rtc.getYear() < 2023){
    setAlarm(131, 1, 5, 1000);
  }
  log_manager->verbose(PSTR(__func__), PSTR("Executed (%dms).\n"), millis() - startMillis);
}


void wifiKeeperTR(void *arg){
  log_manager->debug(PSTR(__func__),PSTR("Initializing wifi network...\n"));
  WiFi.mode(WIFI_STA);
  WiFi.setHostname(config.hname);
  WiFi.setAutoReconnect(true);
  if(!config.wssid || *config.wssid == 0x00 || strlen(config.wssid) > 32)
  {
    configLoadFailSafe();
    log_manager->warn(PSTR(__func__), PSTR("SSID too long or missing! Failsafe config was loaded.\n"));
  }
  wifiMulti.addAP(config.wssid, config.wpass);
  wifiMulti.addAP(config.dssid, config.dpass);

  WiFi.onEvent(cbWiFiOnDisconnected, ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
  WiFi.onEvent(cbWiFiOnGotIp, ARDUINO_EVENT_WIFI_STA_GOT_IP);
  
  while (true)
  {
    wifiMulti.run();
    vTaskDelay((const TickType_t) 30000 / portTICK_PERIOD_MS);
  }
}

#ifdef USE_WEB_IFACE
void onWsEventCb(uint8_t num, WStype_t type, uint8_t * data, size_t length){
  StaticJsonDocument<DOCSIZE_MIN> root;
  JsonObject doc = root.to<JsonObject>();
  switch(type) {
    case WStype_DISCONNECTED:
      {
        if( xSemaphoreConfig != NULL ){
          if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
          {
            if(config.wsCount > 0){
              config.wsCount--;
            }
            xSemaphoreGive( xSemaphoreConfig );
          }
          else
          {
              log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
          }
        }
        
        log_manager->debug(PSTR(__func__), PSTR("ws [%u] disconnect. WsCount: %d\n"), num, config.wsCount);
        doc["evType"] = (int)WStype_DISCONNECTED;
        doc["num"] = num;
        wsEventCb(doc);
      }
      break;
    case WStype_CONNECTED:
      {
        if( xSemaphoreConfig != NULL ){
          if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
          {
            config.wsCount++;
            xSemaphoreGive( xSemaphoreConfig );
          }
          else
          {
              log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
          }
        }
        log_manager->debug(PSTR(__func__), PSTR("ws [%u] connect. WsCount: %d\n"), num, config.wsCount);
        doc["evType"] = (int)WStype_CONNECTED;
        doc["num"] = num;
        wsEventCb(doc);
      }
      break;
    case WStype_TEXT:
      {
        DeserializationError err = deserializeJson(root, data);
        if (err == DeserializationError::Ok)
        {
          log_manager->debug(PSTR(__func__), PSTR("WS message parsing %s\n"), err.c_str());
          doc["evType"] = (int)WStype_TEXT;
          doc["num"] = num;
          wsEventCb(doc);
        }
        else
        {
          log_manager->warn(PSTR(__func__), PSTR("WS message parsing error: %s\n"), err.c_str());
        }
      }
      break;
    case WStype_BIN:
      {

      }
      break;
    case WStype_ERROR:
      {
        log_manager->warn(PSTR(__func__), PSTR("ws [%u] error\n"), num);
        doc["evType"] = (int)WStype_ERROR;
        doc["num"] = num;
        wsEventCb(doc);
      }
      break;			
    case WStype_FRAGMENT_TEXT_START:
    case WStype_FRAGMENT_BIN_START:
    case WStype_FRAGMENT:
    case WStype_FRAGMENT_FIN:
      break;
  }
}
#endif

void udawa() {
  r.execute();
}

void setBuzzer(int32_t beepCount, uint16_t beepDelay){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  doc["method"] = "sBuz";
  params["beepCount"] = beepCount;
  params["beepDelay"] = beepDelay;
  serialWriteToCoMcu(doc, 0);
}

void setLed(uint8_t r, uint8_t g, uint8_t b, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  params["r"] = r;
  params["g"] = g;
  params["b"] = b;
  params["isBlink"] = isBlink;
  params["blinkCount"] = blinkCount;
  params["blinkDelay"] = blinkDelay;
  serialWriteToCoMcu(doc, 0);
}

void setLed(uint8_t color, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay){
uint8_t r, g, b;
  switch (color)
  {
  //Auto by network
  case 0:
    if(tb.connected()){
      r = configcomcu.lON == 0 ? 255 : 0;
      g = configcomcu.lON == 0 ? 255 : 0;
      b = configcomcu.lON;
    }
    else if(WiFi.status() == WL_CONNECTED){
      r = configcomcu.lON == 0 ? 255 : 0;
      g = configcomcu.lON;
      b = configcomcu.lON == 0 ? 255 : 0;
    }
    else{
      r = configcomcu.lON;
      g = configcomcu.lON == 0 ? 255 : 0;
      b = configcomcu.lON == 0 ? 255 : 0;
    }
    break;
  //RED
  case 1:
    r = configcomcu.lON;
    g = configcomcu.lON == 0 ? 255 : 0;
    b = configcomcu.lON == 0 ? 255 : 0;
    break;
  //GREEN
  case 2:
    r = configcomcu.lON == 0 ? 255 : 0;
    g = configcomcu.lON;
    b = configcomcu.lON == 0 ? 255 : 0;
    break;
  //BLUE
  case 3:
    r = configcomcu.lON == 0 ? 255 : 0;
    g = configcomcu.lON == 0 ? 255 : 0;
    b = configcomcu.lON;
    break;
  default:
    r = configcomcu.lON;
    g = configcomcu.lON;
    b = configcomcu.lON;
  }
  StaticJsonDocument<DOCSIZE_MIN> doc;
  doc["method"] = "sLed";
  JsonObject params = doc.createNestedObject("params");
  params["r"] = r;
  params["g"] = g;
  params["b"] = b;
  params["isBlink"] = isBlink;
  params["blinkCount"] = blinkCount;
  params["blinkDelay"] = blinkDelay;
  serialWriteToCoMcu(doc, 0);
}

