Narin-Laboratory/libudawa-esp32/src/libudawa.h
void setAlarm(uint16_t code, uint8_t color, int32_t blinkCount, uint16_t blinkDelay){
  if( xQueueAlarm != NULL ){
    AlarmMessage alarmMsg;
    alarmMsg.code = code; alarmMsg.color = color; alarmMsg.blinkCount = blinkCount; alarmMsg.blinkDelay = blinkDelay;
    if( xQueueSend( xQueueAlarm, &alarmMsg, ( TickType_t ) 1000 ) != pdPASS )
    {
        log_manager->debug(PSTR(__func__), PSTR("Failed to set alarm. Queue is full. \n"));
    }
  }
}

void setAlarmTR(void *arg){
  while(true){
    if( xQueueAlarm != NULL ){
      AlarmMessage alarmMsg;
      if( xQueueReceive( xQueueAlarm,  &( alarmMsg ), ( TickType_t ) 1000 ) == pdPASS )
      {
        setLed(alarmMsg.color, 1, alarmMsg.blinkCount, alarmMsg.blinkDelay);
        setBuzzer(alarmMsg.blinkCount, alarmMsg.blinkDelay);
        if(alarmMsg.code > 0){
          emitAlarm(alarmMsg.code);
        }
        vTaskDelay((const TickType_t) (alarmMsg.blinkCount * alarmMsg.blinkDelay) / portTICK_PERIOD_MS);
      }
    }
    vTaskDelay((const TickType_t) 500 / portTICK_PERIOD_MS);
  }
}

bool plannedRebootOnEnable(){
  return true;
}

void plannedReboot(int countdown){
  plannedRebootOnEnableCb();
  log_manager->warn(PSTR(__func__), PSTR("Device reboot in: %d second(s)\n"), countdown);
  reboot();
}

void reboot()
{
  log_manager->info(PSTR(__func__),PSTR("Device rebooting...\n"));
  esp_task_wdt_init(1,true);
  esp_task_wdt_add(NULL);
  while(true);
}

char* getDeviceId()
{
  char* decodedString = new char[16];
  uint64_t chipid = ESP.getEfuseMac();
  sprintf(decodedString, "%04X%08X",(uint16_t)(chipid>>32), (uint32_t)chipid);
  return decodedString;
}

void configReset()
{
  if( xSemaphoreConfig != NULL ){
    if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
    {
      File file;
      file = SPIFFS.open(configFile, FILE_WRITE);
      if (!file) {
        log_manager->warn(PSTR(__func__),PSTR("Failed to create config file. Config reset is cancelled.\n"));
        file.close();
        xSemaphoreGive( xSemaphoreConfig );
        return;
      }

      StaticJsonDocument<DOCSIZE> doc;

      char dv[16];
      sprintf(dv, "%s", getDeviceId());
      doc["name"] = "UDAWA" + String(dv);
      doc["model"] = "Generic";
      doc["group"] = "UDAWA";
      doc["broker"] = broker;
      doc["port"] = port;
      doc["wssid"] = wssid;
      doc["wpass"] = wpass;
      doc["dssid"] = dssid;
      doc["dpass"] = dpass;
      doc["upass"] = upass;
      doc["accTkn"] = accTkn;
      doc["provSent"] = false;
      doc["provDK"] = provDK;
      doc["provDS"] = provDS;
      doc["logLev"] = 5;
      doc["gmtOff"] = 28880;

      doc["fIoT"] = 1;
      doc["fWOTA"] = 1;
      doc["fIface"] = 1;

      doc["hname"] = "UDAWA" + String(dv);

      doc["htU"] = "UDAWA";
      doc["htP"] = "defaultkey";

      doc["logIP"] = "192.168.18.255";
      doc["logPrt"] = 29514;

      size_t size = serializeJson(doc, file);
      file.close();

      log_manager->info(PSTR(__func__),PSTR("Resetted config file (size: %d) is written successfully...\n"), size);
      file = SPIFFS.open(configFile, FILE_READ);
      if (!file)
      {
        log_manager->warn(PSTR(__func__),PSTR("Failed to open the config file!"));
      }
      else
      {
        log_manager->info(PSTR(__func__),PSTR("New config file opened, size: %d\n"), file.size());

        if(file.size() < 1)
        {
          log_manager->warn(PSTR(__func__),PSTR("Config file size is abnormal: %d, trying to rewrite...\n"), file.size());

          size_t size = serializeJson(doc, file);
          log_manager->info(PSTR(__func__),PSTR("Writing: %d of data, file size: %d\n"), size, file.size());
        }
        else
        {
          log_manager->info(PSTR(__func__),PSTR("Config file size is normal: %d, trying to reboot...\n"), file.size());
          file.close();
          reboot();
        }
      }
      file.close();
      xSemaphoreGive( xSemaphoreConfig );
    }
    else
    {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }
}

void configLoadFailSafe()
{
  if( xSemaphoreConfig != NULL ){
    if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
    {
      char dv[16];
      sprintf(dv, "%s", getDeviceId());
      strlcpy(config.hwid, dv, sizeof(config.hwid));

      String name = "UDAWA" + String(dv);
      strlcpy(config.name, name.c_str(), sizeof(config.name));
      strlcpy(config.model, "Generic", sizeof(config.model));
      strlcpy(config.group, "UDAWA", sizeof(config.group));
      strlcpy(config.broker, broker, sizeof(config.broker));
      strlcpy(config.wssid, wssid, sizeof(config.wssid));
      strlcpy(config.wpass, wpass, sizeof(config.wpass));
      strlcpy(config.dssid, dssid, sizeof(config.dssid));
      strlcpy(config.dpass, dpass, sizeof(config.dpass));
      strlcpy(config.upass, upass, sizeof(config.upass));
      strlcpy(config.accTkn, accTkn, sizeof(config.accTkn));
      config.provSent = false;
      config.port = port;
      strlcpy(config.provDK, provDK, sizeof(config.provDK));
      strlcpy(config.provDS, provDS, sizeof(config.provDS));
      config.logLev = 5;
      config.gmtOff = 28800;

      config.fIoT = 1;
      config.fWOTA = 1;
      config.fIface = 1;
      String hname = "UDAWA" + String(dv);
      strlcpy(config.hname, hname.c_str(), sizeof(config.hname));
      strlcpy(config.htU, "UDAWA", sizeof(config.htU));
      strlcpy(config.htP, "defaultkey", sizeof(config.htP));
      strlcpy(config.logIP, "192.168.18.255", sizeof(config.logIP));
      config.logPrt = 29514;

      xSemaphoreGive( xSemaphoreConfig );
    }
    else
    {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }
}

void configLoad()
{
  if( xSemaphoreConfig != NULL ){
    if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE )
    {
      log_manager->info(PSTR(__func__),PSTR("Loading config file.\n"));
      File file = SPIFFS.open(configFile, FILE_READ);
      if(file.size() > 1)
      {
        log_manager->info(PSTR(__func__),PSTR("Config file size is normal: %d, trying to fit it in %d docsize.\n"), file.size(), DOCSIZE);
      }
      else
      {
        file.close();
        log_manager->warn(PSTR(__func__),PSTR("Config file size is abnormal: %d. Closing file and trying to reset...\n"), file.size());
        xSemaphoreGive( xSemaphoreConfig );
        configReset();
        return;
      }

      StaticJsonDocument<DOCSIZE> doc;
      DeserializationError error = deserializeJson(doc, file);

      if(error)
      {
        log_manager->warn(PSTR(__func__),PSTR("Failed to load config file! (%s - %s - %d). Falling back to failsafe.\n"), configFile, error.c_str(), file.size());
        file.close();
        xSemaphoreGive( xSemaphoreConfig );
        configLoadFailSafe();
        return;
      }
      else
      {
        char dv[16];
        sprintf(dv, "%s", getDeviceId());
        strlcpy(config.hwid, dv, sizeof(config.hwid));

        log_manager->info(PSTR(__func__),PSTR("Device ID: %s\n"), dv);


        String name = "UDAWA" + String(dv);
        strlcpy(config.name, name.c_str(), sizeof(config.name));
        //strlcpy(config.name, doc["name"].as<const char*>(), sizeof(config.name));
        if(doc["model"] != nullptr){strlcpy(config.model, doc["model"].as<const char*>(), sizeof(config.model));}
        if(doc["group"] != nullptr){strlcpy(config.group, doc["group"].as<const char*>(), sizeof(config.group));}
        if(doc["broker"] != nullptr){strlcpy(config.broker, doc["broker"].as<const char*>(), sizeof(config.broker));}
        if(doc["port"] != nullptr){config.port = doc["port"].as<uint16_t>();}
        if(doc["wssid"] != nullptr){strlcpy(config.wssid, doc["wssid"].as<const char*>(), sizeof(config.wssid));}
        if(doc["wpass"] != nullptr){strlcpy(config.wpass, doc["wpass"].as<const char*>(), sizeof(config.wpass));}
        if(doc["dssid"] != nullptr){strlcpy(config.dssid, doc["dssid"].as<const char*>(), sizeof(config.dssid));}
        if(doc["dpass"] != nullptr){strlcpy(config.dpass, doc["dpass"].as<const char*>(), sizeof(config.dpass));}
        if(doc["upass"] != nullptr){strlcpy(config.upass, doc["upass"].as<const char*>(), sizeof(config.upass));}
        if(doc["accTkn"] != nullptr){strlcpy(config.accTkn, doc["accTkn"].as<const char*>(), sizeof(config.accTkn));}
        if(doc["provDK"] != nullptr){strlcpy(config.provDK, doc["provDK"].as<const char*>(), sizeof(config.provDK));}
        if(doc["provDS"] != nullptr){strlcpy(config.provDS, doc["provDS"].as<const char*>(), sizeof(config.provDS));}
        if(doc["provSent"] != nullptr){config.provSent = doc["provSent"].as<bool>();}
        if(doc["logLev"] != nullptr){config.logLev = doc["logLev"].as<uint8_t>(); log_manager->set_log_level(PSTR("*"), (LogLevel) config.logLev);;}
        if(doc["gmtOff"] != nullptr){config.gmtOff = doc["gmtOff"].as<int>();}
        if(doc["fIoT"] != nullptr){config.fIoT = doc["fIoT"].as<int>();}
        if(doc["htU"] != nullptr){strlcpy(config.htU, doc["htU"].as<const char*>(), sizeof(config.htU));}
        if(doc["htP"] != nullptr){strlcpy(config.htP, doc["htP"].as<const char*>(), sizeof(config.htP));}
        if(doc["fWOTA"] != nullptr){config.fWOTA = doc["fWOTA"].as<bool>();}
        if(doc["fIface"] != nullptr){config.fIface = doc["fIface"].as<bool>();}
        if(doc["hname"] != nullptr){strlcpy(config.hname, doc["hname"].as<const char*>(), sizeof(config.hname));}
        if(doc["logIP"] != nullptr){strlcpy(config.logIP, doc["logIP"].as<const char*>(), sizeof(config.logIP));}
        if(doc["logPrt"] != nullptr){config.logPrt = doc["logPrt"].as<uint16_t>();}

        int jsonSize = JSON_STRING_SIZE(measureJson(doc));
        char buffer[jsonSize];
        serializeJson(doc, buffer, jsonSize);
        log_manager->verbose(PSTR(__func__),PSTR("Loaded config: %s.\n"), buffer);
      }
      file.close();
      xSemaphoreGive( xSemaphoreConfig );
    }
    else
    {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }
}

void configSave()
{
  if( xSemaphoreConfig != NULL ){
    if( xSemaphoreTake( xSemaphoreConfig, ( TickType_t ) 1000 ) == pdTRUE ) {
      if(!SPIFFS.remove(configFile))
      {
        log_manager->warn(PSTR(__func__),PSTR("Failed to delete the old configFile: %s\n"), configFile);
      }
      File file = SPIFFS.open(configFile, FILE_WRITE);
      if (!file)
      {
        file.close();
        xSemaphoreGive( xSemaphoreConfig );
        return;
      }

      StaticJsonDocument<DOCSIZE> doc;
      doc["name"] = config.name;
      doc["model"] = config.model;
      doc["group"] = config.group;
      doc["broker"] = config.broker;
      doc["port"]  = config.port;
      doc["wssid"] = config.wssid;
      doc["wpass"] = config.wpass;
      doc["dssid"] = config.dssid;
      doc["dpass"] = config.dpass;
      doc["upass"] = config.upass;
      doc["accTkn"] = config.accTkn;
      doc["provSent"] = config.provSent;
      doc["provDK"] = config.provDK;
      doc["provDS"] = config.provDS;
      doc["logLev"] = config.logLev;
      doc["gmtOff"] = config.gmtOff;

      doc["fIoT"] = config.fIoT;
      doc["fWOTA"] = config.fWOTA;
      doc["fIface"] = config.fIface;
      doc["hname"] = config.hname;
      doc["htU"] = config.htU;
      doc["htP"] = config.htP;

      doc["logIP"] = config.logIP;
      doc["logPrt"] = config.logPrt;

      serializeJson(doc, file);
      file.close();
      log_manager->verbose(PSTR(__func__), PSTR("Config saved successfully.\n."));
      xSemaphoreGive( xSemaphoreConfig );
    }
    else
    {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }
}


void configCoMCUReset()
{
  if( xSemaphoreConfigCoMCU != NULL ){
    if( xSemaphoreTake( xSemaphoreConfigCoMCU, ( TickType_t ) 1000 ) == pdTRUE )
    {
      SPIFFS.remove(configFileCoMCU);
      File file = SPIFFS.open(configFileCoMCU, FILE_WRITE);
      if (!file) {
        file.close();
        xSemaphoreGive( xSemaphoreConfigCoMCU );
        return;
      }

      StaticJsonDocument<DOCSIZE> doc;

