Narin-Laboratory/libudawa-esp32/src/libudawa.h
      doc["fP"] = false;

      doc["bFr"] = 1600;
      doc["fB"] = 1;

      doc["pBz"] = 2;
      doc["pLR"] = 3;
      doc["pLG"] = 5;
      doc["pLB"] = 6;
      doc["lON"] = 0;

      serializeJson(doc, file);
      file.close();

      log_manager->info(PSTR(__func__),PSTR("ConfigCoMCU hard reset!\n")); 
      xSemaphoreGive( xSemaphoreConfigCoMCU );
    }
    else
    {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }
}

void configCoMCULoad()
{
  if( xSemaphoreConfigCoMCU != NULL ){
    if( xSemaphoreTake( xSemaphoreConfigCoMCU, ( TickType_t ) 1000 ) == pdTRUE )
    {
      File file = SPIFFS.open(configFileCoMCU);
      StaticJsonDocument<DOCSIZE> doc;
      DeserializationError error = deserializeJson(doc, file);

      if(error)
      {
        file.close();
        xSemaphoreGive( xSemaphoreConfigCoMCU );
        configCoMCUReset();
        return;
      }
      else
      {

        if(doc["fP"] != nullptr){configcomcu.fP = doc["fP"].as<bool>();}
        if(doc["bFr"] != nullptr){configcomcu.bFr = doc["bFr"].as<uint16_t>();}
        if(doc["fB"] != nullptr){configcomcu.fB = doc["fB"].as<bool>();}
        if(doc["pBz"] != nullptr){configcomcu.pBz = doc["pBz"].as<uint8_t>();}
        if(doc["pLR"] != nullptr){configcomcu.pLR = doc["pLR"].as<uint8_t>();}
        if(doc["pLG"] != nullptr){configcomcu.pLG = doc["pLG"].as<uint8_t>();}
        if(doc["pLB"] != nullptr){configcomcu.pLB = doc["pLB"].as<uint8_t>();}
        if(doc["lON"] != nullptr){configcomcu.lON = doc["lON"].as<uint8_t>();}

        log_manager->info(PSTR(__func__),PSTR("ConfigCoMCU loaded successfuly.\n"));
      }
      file.close(); 
      xSemaphoreGive( xSemaphoreConfigCoMCU );
    }
    else
    {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }
}

void configCoMCUSave()
{
  if( xSemaphoreConfigCoMCU != NULL ){
    if( xSemaphoreTake( xSemaphoreConfigCoMCU, ( TickType_t ) 1000 ) == pdTRUE )
    {
      if(!SPIFFS.remove(configFileCoMCU))
      {
        log_manager->warn(PSTR(__func__),PSTR("Failed to delete the old configFileCoMCU: %s\n"), configFileCoMCU);
      }
      File file = SPIFFS.open(configFileCoMCU, FILE_WRITE);
      if (!file)
      {
        file.close();
        xSemaphoreGive( xSemaphoreConfigCoMCU );
        return;
      }

      StaticJsonDocument<DOCSIZE> doc;

      doc["fP"] = configcomcu.fP;

      doc["bFr"] = configcomcu.bFr;
      doc["fB"] = configcomcu.fB;

      doc["pBz"] = configcomcu.pBz;
      doc["pLR"] = configcomcu.pLR;
      doc["pLG"] = configcomcu.pLG;
      doc["pLB"] = configcomcu.pLB;
      doc["lON"] = configcomcu.lON;

      serializeJson(doc, file);
      file.close();
      log_manager->verbose(PSTR(__func__), PSTR("ConfigCoMCU saved successfully.\n."));
      xSemaphoreGive( xSemaphoreConfigCoMCU );
    }
    else
    {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }
}

void syncConfigCoMCU()
{
  configCoMCULoad();
  if( xSemaphoreConfigCoMCU != NULL ){
    if( xSemaphoreTake( xSemaphoreConfigCoMCU, ( TickType_t ) 1000 ) == pdTRUE )
    {
      StaticJsonDocument<DOCSIZE_MIN> doc;
      doc["fP"] = configcomcu.fP;
      doc["bFr"] = configcomcu.bFr;
      doc["fB"] = configcomcu.fB;
      doc["pBz"] = configcomcu.pBz;
      doc["method"] = "sCfg";
      serialWriteToCoMcu(doc, 0);
      doc.clear();
      doc["pLR"] = configcomcu.pLR;
      doc["pLG"] = configcomcu.pLG;
      doc["pLB"] = configcomcu.pLB;
      doc["lON"] = configcomcu.lON;
      doc["method"] = "sCfg";
      serialWriteToCoMcu(doc, 0);
      doc.clear();
      xSemaphoreGive( xSemaphoreConfigCoMCU );
    }
    else
    {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }
}

bool loadFile(const char* filePath, char *buffer)
{
  File file = SPIFFS.open(filePath);
  if(!file || file.isDirectory()){
      file.close();
      return false;
  }
  uint16_t i = 0;
  while(file.available()){
    buffer[i] = file.read();
    i++;
  }
  buffer[i] = '\0';
  file.close();
  return true;
}

void serialWriteToCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc, bool isRpc)
{
  if( xSemaphoreSerialCoMCU != NULL ){
      /* See if we can obtain the semaphore.  If the semaphore is not
      available wait 10 ticks to see if it becomes free. */
      if( xSemaphoreTake( xSemaphoreSerialCoMCU, ( TickType_t ) 10000 ) == pdTRUE )
      {
          /* We were able to obtain the semaphore and can now access the
          shared resource. */

          //long startMillis = millis();
          serializeJson(doc, Serial2);
          StringPrint stream;
          serializeJson(doc, stream);
          //String result = stream.str();
          //log_manager->verbose(PSTR(__func__),PSTR("Sent to CoMCU: %s\n"), result.c_str());
          if(isRpc)
          {
            delay(50);
            doc.clear();
            serialReadFromCoMcu(doc);
          }
          //log_manager->verbose(PSTR(__func__), PSTR("Executed (%dms).\n"), millis() - startMillis);

          /* We have finished accessing the shared resource.  Release the
          semaphore. */
          xSemaphoreGive( xSemaphoreSerialCoMCU );
      }
      else
      {
          /* We could not obtain the semaphore and can therefore not access
          the shared resource safely. */
          log_manager->debug(PSTR(__func__), PSTR("Undable to get semaphore.\n"));
      }
  }
}

void serialReadFromCoMcu(StaticJsonDocument<DOCSIZE_MIN> &doc)
{
  if( xSemaphoreSerialCoMCU != NULL ){
      /* See if we can obtain the semaphore.  If the semaphore is not
      available wait 10 ticks to see if it becomes free. */
      if( xSemaphoreTake( xSemaphoreSerialCoMCU, ( TickType_t ) 10000 ) == pdTRUE )
      {
          /* We were able to obtain the semaphore and can now access the
          shared resource. */

          //long startMillis = millis();
          StringPrint stream;
          String result;
          ReadLoggingStream loggingStream(Serial2, stream);
          DeserializationError err = deserializeJson(doc, loggingStream);
          //result = stream.str();
          if (err == DeserializationError::Ok)
          {
            //log_manager->verbose(PSTR(__func__),PSTR("Received from CoMCU: %s\n"), result.c_str());
          }
          else
          {
            //log_manager->verbose(PSTR(__func__),PSTR("Serial2CoMCU DeserializeJson() returned: %s, content: %s\n"), err.c_str(), result.c_str());
            return;
          }
          //log_manager->verbose(PSTR(__func__), PSTR("Executed (%dms).\n"), millis() - startMillis);

          /* We have finished accessing the shared resource.  Release the
          semaphore. */
          xSemaphoreGive( xSemaphoreSerialCoMCU );
      }
      else
      {
          /* We could not obtain the semaphore and can therefore not access
          the shared resource safely. */
          log_manager->debug(PSTR(__func__), PSTR("Undable to get semaphore.\n"));
      }
  }
}


void readSettings(StaticJsonDocument<DOCSIZE> &doc, const char* path)
{
  if( xSemaphoreSettings != NULL ){
    if( xSemaphoreTake( xSemaphoreSettings, ( TickType_t ) 1000 ) == pdTRUE )
    {
      File file = SPIFFS.open(path);
      DeserializationError error = deserializeJson(doc, file);

      if(error)
      {
        file.close();
        xSemaphoreGive( xSemaphoreSettings );
        return;
      }
      file.close();
      xSemaphoreGive( xSemaphoreSettings );
    }
    else
    {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }
}

void writeSettings(StaticJsonDocument<DOCSIZE> &doc, const char* path)
{
  if( xSemaphoreSettings != NULL ){
    if( xSemaphoreTake( xSemaphoreSettings, ( TickType_t ) 1000 ) == pdTRUE )
    {
      SPIFFS.remove(path);
      File file = SPIFFS.open(path, FILE_WRITE);
      if (!file)
      {
        file.close();
        xSemaphoreGive( xSemaphoreSettings );
        return;
      }
      serializeJson(doc, file);
      file.close();
      xSemaphoreGive( xSemaphoreSettings );
    }
    else
    {
        log_manager->verbose(PSTR(__func__), PSTR("No semaphore available.\n."));
    }
  }
}

void setCoMCUPin(uint8_t pin, uint8_t op, uint8_t mode, uint16_t aval, uint8_t state)
{
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  doc["method"] = "sPin";
  params["pin"] = pin;
  params["mode"] = mode;
  params["op"] = op;
  params["state"] = state;
  params["aval"] = aval;
  serialWriteToCoMcu(doc, false);
}

double round2(double value) {
   return (int)(value * 100 + 0.5) / 100.0;
}

